/******************************************************************************
*  	名称：	APP.c
*  	功能：	应用层函数
*  	日期:	2016-8-5
*  	初始建立： zcq
* 	修改:
*  2016.08.22：添加RF4460处理相关程序  Root
******************************************************************************/
#include	"RF_include.h"

/****************************************************************************
 * 名称：BOOL	InitAPP(void)
 * 功能：初始化应用层
 * 输入参数:无
 * 返回值:bool
 *****************************************************************************/
BOOL	Init_RF_APP(void)
{
//	添加内容
	InitMID();
	InitPara();
	InitProt();

	//初始化MAC层
	Spi_Init();
	Radio_Init();

	//将RF至于LDC监听模式，开启时钟校准（校准周期128s）
	Enter_LDCRX_mode(1);

	return	true;
}


/****************************************************************************
 * 名称：void	APP_RfRxHandle(void)
 * 功能： 应用层接收处理
 * 输入参数:无
 * 返回值:
 *****************************************************************************/
void	APP_RfRxHandle(void)
{
	if(!RxFlag)
	{
		return  ;
	}
	APP_RecMIDData();
}
/****************************************************************************
 * 名称：void	APP_RfTxHandle(void)
 * 功能： 应用层发送处理
 * 输入参数:无
 * 返回值:
 *****************************************************************************/
void	APP_RfTxHandle(void)
{
	while(TxFlag)
	{

	}

}












